; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star5 spectrograph2)
	(have_image Star6 image1)
	(have_image Phenomenon7 spectrograph0)
	(have_image Planet8 image1)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 image1)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph2)
	(have_image Star13 image1)
	(have_image Planet14 spectrograph2)
	(have_image Star15 spectrograph2)
	(have_image Planet16 spectrograph0)
	(have_image Planet17 image1)
	(have_image Phenomenon18 spectrograph2)
	(have_image Phenomenon19 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star3)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 15
5. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 1 of 15
6. (turn_to satellite0 phenomenon19 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon19)
   goals met: 1 of 15
7. (take_image satellite0 phenomenon19 instrument0 spectrograph0)
   added: (have_image phenomenon19 spectrograph0)
   goals met: 2 of 15
8. (turn_to satellite0 phenomenon18 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 15
9. (take_image satellite0 phenomenon18 instrument0 spectrograph2)
   added: (have_image phenomenon18 spectrograph2)
   goals met: 3 of 15
10. (turn_to satellite0 phenomenon12 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 15
11. (take_image satellite0 phenomenon12 instrument0 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 4 of 15
12. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 4 of 15
13. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 5 of 15
14. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 5 of 15
15. (take_image satellite0 planet11 instrument0 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 6 of 15
16. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 6 of 15
17. (take_image satellite0 planet14 instrument0 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 7 of 15
18. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 7 of 15
19. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 8 of 15
20. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 8 of 15
21. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 9 of 15
22. (turn_to satellite0 planet8 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet8)
   goals met: 9 of 15
23. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 10 of 15
24. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 10 of 15
25. (take_image satellite0 planet9 instrument0 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 11 of 15
26. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 11 of 15
27. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 12 of 15
28. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 12 of 15
29. (take_image satellite0 star15 instrument0 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 13 of 15
30. (turn_to satellite0 star5 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star5)
   goals met: 13 of 15
31. (take_image satellite0 star5 instrument0 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 14 of 15
32. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 14 of 15
33. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 15 of 15
